app/controllers/api/events_controller.rb

    def show
        @event = Event.find_by(id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]

    def create
      @event = Event.new(event_params)
      @GENRES = Event.GENRES

      if @event.save
---
INSERT INTO "events" ("title", "description", "location", "genre", "start_date", "end_date", "start_time", "end_time", "host_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def update
        @event = Event.find_by(id: params[:id])
        @GENRES = Event.GENRES

        if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
UPDATE "events" SET "title" = $1, "end_date" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["title", "Country Nights-Extra night added!"], ["end_date", "2021-07-15"], ["updated_at", "2021-07-09 19:28:01.638567"], ["id", 7]]

    def destroy
        @event = Event.find(params[:id])

        if @event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 14]]